#+TITLE: Practice Exam
# #+STARTUP: latexpreview
# #+PLOT: title:"Citas" ind:1 deps:(3) type:2d with:histograms set:"yrange [0:]"
# #+HTML_HEAD_EXTRA: <link rel="alternate stylesheet" type="text/css"href="style2.css" />
#+INFOJS_OPT: view:showall toc:3
#+OPTIONS: tex:t
#+CSL_STYLE: /home/ryan/Templates/CSL/nature.csl
#+CATEGORY: Exemplar
#+LATEX_HEADER: \usepackage{/home/ryan/Dropbox/profiles/Templates/LaTeX/ScreenStyle}
#+PROPERTY: header-args:R :session Final :dir ./ :cache yes :eval never-export :exports both :results output

#+TITLE: 05 PCA and MDS Visualisation

# #+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="style.css">
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="/home/ryan/Templates/CSS/Org-CSS/bigblow.css">

*** What is the vector value of the query.
If the query is ~T1 T3~ then it only contains:

+ =T1= once
+ =T2= once

And hence can be represented by the frequency vector $q$:

#+begin_src R
q <- c(1, 0, 1)
#+end_src

The Cosine Distance is $1- \cos\left( \theta \right)$ so that the a smaller
value indicates a smaller distance.

#+begin_src R
d1 <- c(1, 1, 2)
d2 <- c(0, 2, 1)
d3 <- c(3, 1, 0)
#+end_src


First scale the documents to size 1, this can be acheived by dividing through by the euclidean distance:

#+begin_src R :exports output :results output
(d1_u <- c(1, 1, 2) *1/sqrt(1^2 + 1^2 + 2^2))
(d2_u <- c(0, 2, 1)* 1/sqrt(0^2 + 2^2 + 1^2))
(d3_u <- c(3, 1, 0)* 1/sqrt(3^2 + 1^2 + 0^2))
(q_u  <- c(1, 0, 1)* 1/sqrt(1^2 + 0^2 + 1^2))
#+end_src

#+RESULTS[5f99a3aa0280df1875c98ec7be88979f1612b171]:
: [1] 0.4082483 0.4082483 0.8164966
:
: [1] 0.0000000 0.8944272 0.4472136
:
: [1] 0.9486833 0.3162278 0.0000000
:
: [1] 0.7071068 0.0000000 0.7071068

and then taking the dot products, obviously I won't use the built in function, but I'll write my own to save repetition:

#+begin_quote
The dot product of two vectors is the sum of the multiple of each corresponding term of two vectors.
#+end_quote

#+begin_src R :results output
## By default R multiplies the terms pairwise.

print(sum(d1_u * q_u))
print(sum(d2_u * q_u))
print(sum(d3_u * q_u))
#+end_src

#+RESULTS[8be3547f417b4a17971ba192979a5c9623de06e8]:
:
: [1] 0.8660254
:
: [1] 0.3162278
:
: [1] 0.6708204


Hence:

+ The distance from D1 to the qury is 0.87
+ The distance from D2 to the qury is 0.32
+ The distance from D3 to the qury is 0.67

** (d) Is it stationary

If the distribution is stationary then the recurrence relation will not change, so for example:


#+begin_src R
(S <- λ*T + (1-λ)*B)
(p <- c(0.49, 0.34, 0.10, 0.04, 0.03)) %>% as.matrix()
S %*% p
#+end_src

#+RESULTS[123c76de3b059cb64e82313c8864828739123669]:
#+begin_example
     [,1] [,2] [,3] [,4] [,5]
[1,] 0.04 0.84 0.44 0.44 0.44
[2,] 0.04 0.04 0.44 0.04 0.04
[3,] 0.04 0.04 0.04 0.04 0.04
[4,] 0.04 0.04 0.04 0.04 0.44
[5,] 0.04 0.04 0.04 0.44 0.04

     [,1]
[1,] 0.49
[2,] 0.34
[3,] 0.10
[4,] 0.04
[5,] 0.03

      [,1]
[1,] 0.380
[2,] 0.080
[3,] 0.040
[4,] 0.052
[5,] 0.056
#+end_example

In this case the probability transition matrix changed after an iteration of the recurrence relation and so this is not a stationary point.


*** Periodic

Subtact the Trend from the observations:



S = Y - T


|       | Period 1          | Period 2          | Period 3      |
| Day 1 | NA                | 8.76-sqrt(97)     | 8.8-sqrt(69)  |
| Day 2 | sqrt(68) - 9.03   | sqrt(111) - 6.96  | sqrt(87) - 10 |
| Day 3 | sqrt(103) - 10.02 | sqrt(112) - 10.02 | NA            |


Now take the column averages

#+begin_src R
sp <-
c(

mean(c(sqrt(68) - 9.03, sqrt(103) - 10.02)),

mean(c(sqrt(97) - 8.76,
 sqrt(111) - 6.96,
 sqrt(112) - 10.02)),


mean(c(sqrt(69) - 8.8,
  sqrt(87) - 10 ))

)
sp
#+end_src

#+RESULTS[1661e353b3a7103a4ba8d1878fdcd9674f6c2fda]:
:
: [1] -0.3274486  1.7425056 -0.5829985

Unfourtunately this does not sum to zero so we fix that:

#+begin_src R
(S <- sp - mean(sp))
#+end_src

#+RESULTS[6d7a212b30399b9edad14d83304680812c9ac253]:
: [1] -0.6048014  1.4651528 -0.8603514

This does not match the sheet but I don't understand why?

